zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K148_LQFP176-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_cfg_utils.py
 * for S32K148_LQFP176/signal_configuration.xml
 *
 * Copyright 2023, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K148_LQFP176_
#define _ZEPHYR_DTS_BINDING_S32K148_LQFP176_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define CMP0_IN0_PTA0 KINETIS_MUX('A',0,0) /* PTA0 */
#define ADC0_SE0_PTA0 KINETIS_MUX('A',0,0) /* PTA0 */
#define PTA0 KINETIS_MUX('A',0,1) /* PTA0 */
#define FTM2_CH1_PTA0 KINETIS_MUX('A',0,2) /* PTA0 */
#define LPI2C0_SCLS_PTA0 KINETIS_MUX('A',0,3) /* PTA0 */
#define FXIO_D2_PTA0 KINETIS_MUX('A',0,4) /* PTA0 */
#define FTM2_QD_PHA_PTA0 KINETIS_MUX('A',0,5) /* PTA0 */
#define LPUART0_CTS_PTA0 KINETIS_MUX('A',0,6) /* PTA0 */
#define TRGMUX_OUT3_PTA0 KINETIS_MUX('A',0,7) /* PTA0 */
#define ADC0_SE1_PTA1 KINETIS_MUX('A',1,0) /* PTA1 */
#define CMP0_IN1_PTA1 KINETIS_MUX('A',1,0) /* PTA1 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA1 */
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,2) /* PTA1 */
#define LPI2C0_SDAS_PTA1 KINETIS_MUX('A',1,3) /* PTA1 */
#define FXIO_D3_PTA1 KINETIS_MUX('A',1,4) /* PTA1 */
#define FTM1_QD_PHA_PTA1 KINETIS_MUX('A',1,5) /* PTA1 */
#define LPUART0_RTS_PTA1 KINETIS_MUX('A',1,6) /* PTA1 */
#define TRGMUX_OUT0_PTA1 KINETIS_MUX('A',1,7) /* PTA1 */
#define ADC1_SE0_PTA2 KINETIS_MUX('A',2,0) /* PTA2 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA2 */
#define FTM3_CH0_PTA2 KINETIS_MUX('A',2,2) /* PTA2 */
#define LPI2C0_SDA_PTA2 KINETIS_MUX('A',2,3) /* PTA2 */
#define EWM_OUT_b_PTA2 KINETIS_MUX('A',2,4) /* PTA2 */
#define FXIO_D4_PTA2 KINETIS_MUX('A',2,5) /* PTA2 */
#define LPUART0_RX_PTA2 KINETIS_MUX('A',2,6) /* PTA2 */
#define ADC1_SE1_PTA3 KINETIS_MUX('A',3,0) /* PTA3 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA3 */
#define FTM3_CH1_PTA3 KINETIS_MUX('A',3,2) /* PTA3 */
#define LPI2C0_SCL_PTA3 KINETIS_MUX('A',3,3) /* PTA3 */
#define EWM_IN_PTA3 KINETIS_MUX('A',3,4) /* PTA3 */
#define FXIO_D5_PTA3 KINETIS_MUX('A',3,5) /* PTA3 */
#define LPUART0_TX_PTA3 KINETIS_MUX('A',3,6) /* PTA3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA4 */
#define CMP0_OUT_PTA4 KINETIS_MUX('A',4,4) /* PTA4 */
#define EWM_OUT_b_PTA4 KINETIS_MUX('A',4,5) /* PTA4 */
#define SWD_DIO_PTA4 KINETIS_MUX('A',4,7) /* PTA4 */
#define JTAG_TMS_PTA4 KINETIS_MUX('A',4,7) /* PTA4 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA5 */
#define TCLK1_PTA5 KINETIS_MUX('A',5,3) /* PTA5 */
#define RESET_b_PTA5 KINETIS_MUX('A',5,7) /* PTA5 */
#define ADC0_SE2_PTA6 KINETIS_MUX('A',6,0) /* PTA6 */
#define PTA6 KINETIS_MUX('A',6,1) /* PTA6 */
#define FTM0_FLT1_PTA6 KINETIS_MUX('A',6,2) /* PTA6 */
#define LPSPI1_PCS1_PTA6 KINETIS_MUX('A',6,3) /* PTA6 */
#define FTM5_CH5_PTA6 KINETIS_MUX('A',6,4) /* PTA6 */
#define LPUART1_CTS_PTA6 KINETIS_MUX('A',6,6) /* PTA6 */
#define ADC0_SE3_PTA7 KINETIS_MUX('A',7,0) /* PTA7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA7 */
#define FTM0_FLT2_PTA7 KINETIS_MUX('A',7,2) /* PTA7 */
#define FTM5_CH3_PTA7 KINETIS_MUX('A',7,3) /* PTA7 */
#define RTC_CLKIN_PTA7 KINETIS_MUX('A',7,4) /* PTA7 */
#define LPUART1_RTS_PTA7 KINETIS_MUX('A',7,6) /* PTA7 */
#define PTA8 KINETIS_MUX('A',8,1) /* PTA8 */
#define LPUART2_RX_PTA8 KINETIS_MUX('A',8,2) /* PTA8 */
#define LPSPI2_SOUT_PTA8 KINETIS_MUX('A',8,3) /* PTA8 */
#define FXIO_D6_PTA8 KINETIS_MUX('A',8,4) /* PTA8 */
#define FTM3_FLT3_PTA8 KINETIS_MUX('A',8,5) /* PTA8 */
#define FTM4_FLT1_PTA8 KINETIS_MUX('A',8,6) /* PTA8 */
#define PTA9 KINETIS_MUX('A',9,1) /* PTA9 */
#define LPUART2_TX_PTA9 KINETIS_MUX('A',9,2) /* PTA9 */
#define LPSPI2_PCS0_PTA9 KINETIS_MUX('A',9,3) /* PTA9 */
#define FXIO_D7_PTA9 KINETIS_MUX('A',9,4) /* PTA9 */
#define FTM3_FLT2_PTA9 KINETIS_MUX('A',9,5) /* PTA9 */
#define FTM1_FLT3_PTA9 KINETIS_MUX('A',9,6) /* PTA9 */
#define FTM4_FLT0_PTA9 KINETIS_MUX('A',9,7) /* PTA9 */
#define PTA10 KINETIS_MUX('A',10,1) /* PTA10 */
#define FTM1_CH4_PTA10 KINETIS_MUX('A',10,2) /* PTA10 */
#define FXIO_D0_PTA10 KINETIS_MUX('A',10,4) /* PTA10 */
#define noetm_TRACE_SWO_PTA10 KINETIS_MUX('A',10,7) /* PTA10 */
#define JTAG_TDO_PTA10 KINETIS_MUX('A',10,7) /* PTA10 */
#define PTA11 KINETIS_MUX('A',11,1) /* PTA11 */
#define FTM1_CH5_PTA11 KINETIS_MUX('A',11,2) /* PTA11 */
#define FXIO_D1_PTA11 KINETIS_MUX('A',11,4) /* PTA11 */
#define CMP0_RRT_PTA11 KINETIS_MUX('A',11,5) /* PTA11 */
#define SAI0_SYNC_PTA11 KINETIS_MUX('A',11,6) /* PTA11 */
#define PTA12 KINETIS_MUX('A',12,1) /* PTA12 */
#define FTM1_CH6_PTA12 KINETIS_MUX('A',12,2) /* PTA12 */
#define CAN1_RX_PTA12 KINETIS_MUX('A',12,3) /* PTA12 */
#define LPI2C1_SDAS_PTA12 KINETIS_MUX('A',12,4) /* PTA12 */
#define FTM2_QD_PHB_PTA12 KINETIS_MUX('A',12,6) /* PTA12 */
#define SAI0_BCLK_PTA12 KINETIS_MUX('A',12,7) /* PTA12 */
#define PTA13 KINETIS_MUX('A',13,1) /* PTA13 */
#define FTM1_CH7_PTA13 KINETIS_MUX('A',13,2) /* PTA13 */
#define CAN1_TX_PTA13 KINETIS_MUX('A',13,3) /* PTA13 */
#define LPI2C1_SCLS_PTA13 KINETIS_MUX('A',13,4) /* PTA13 */
#define FTM2_QD_PHA_PTA13 KINETIS_MUX('A',13,6) /* PTA13 */
#define SAI0_D0_PTA13 KINETIS_MUX('A',13,7) /* PTA13 */
#define PTA14 KINETIS_MUX('A',14,1) /* PTA14 */
#define FTM0_FLT0_PTA14 KINETIS_MUX('A',14,2) /* PTA14 */
#define FTM3_FLT1_PTA14 KINETIS_MUX('A',14,3) /* PTA14 */
#define EWM_IN_PTA14 KINETIS_MUX('A',14,4) /* PTA14 */
#define FTM1_FLT0_PTA14 KINETIS_MUX('A',14,6) /* PTA14 */
#define SAI0_D3_PTA14 KINETIS_MUX('A',14,7) /* PTA14 */
#define ADC1_SE12_PTA15 KINETIS_MUX('A',15,0) /* PTA15 */
#define PTA15 KINETIS_MUX('A',15,1) /* PTA15 */
#define FTM1_CH2_PTA15 KINETIS_MUX('A',15,2) /* PTA15 */
#define LPSPI0_PCS3_PTA15 KINETIS_MUX('A',15,3) /* PTA15 */
#define LPSPI2_PCS3_PTA15 KINETIS_MUX('A',15,4) /* PTA15 */
#define FTM7_FLT0_PTA15 KINETIS_MUX('A',15,5) /* PTA15 */
#define ADC1_SE13_PTA16 KINETIS_MUX('A',16,0) /* PTA16 */
#define PTA16 KINETIS_MUX('A',16,1) /* PTA16 */
#define FTM1_CH3_PTA16 KINETIS_MUX('A',16,2) /* PTA16 */
#define LPSPI1_PCS2_PTA16 KINETIS_MUX('A',16,3) /* PTA16 */
#define PTA17 KINETIS_MUX('A',17,1) /* PTA17 */
#define FTM0_CH6_PTA17 KINETIS_MUX('A',17,2) /* PTA17 */
#define FTM3_FLT0_PTA17 KINETIS_MUX('A',17,3) /* PTA17 */
#define EWM_OUT_b_PTA17 KINETIS_MUX('A',17,4) /* PTA17 */
#define FTM5_FLT0_PTA17 KINETIS_MUX('A',17,5) /* PTA17 */
#define PTA18 KINETIS_MUX('A',18,1) /* PTA18 */
#define FTM4_CH0_PTA18 KINETIS_MUX('A',18,2) /* PTA18 */
#define LPUART1_TX_PTA18 KINETIS_MUX('A',18,3) /* PTA18 */
#define LPSPI1_SOUT_PTA18 KINETIS_MUX('A',18,4) /* PTA18 */
#define FTM6_CH0_PTA18 KINETIS_MUX('A',18,5) /* PTA18 */
#define PTA19 KINETIS_MUX('A',19,1) /* PTA19 */
#define FTM4_CH1_PTA19 KINETIS_MUX('A',19,2) /* PTA19 */
#define LPUART1_RX_PTA19 KINETIS_MUX('A',19,3) /* PTA19 */
#define LPSPI1_SCK_PTA19 KINETIS_MUX('A',19,4) /* PTA19 */
#define PTA20 KINETIS_MUX('A',20,1) /* PTA20 */
#define FTM4_CH2_PTA20 KINETIS_MUX('A',20,2) /* PTA20 */
#define LPSPI1_SIN_PTA20 KINETIS_MUX('A',20,4) /* PTA20 */
#define PTA21 KINETIS_MUX('A',21,1) /* PTA21 */
#define FTM4_CH3_PTA21 KINETIS_MUX('A',21,2) /* PTA21 */
#define FXIO_D0_PTA21 KINETIS_MUX('A',21,3) /* PTA21 */
#define LPSPI1_PCS0_PTA21 KINETIS_MUX('A',21,4) /* PTA21 */
#define PTA22 KINETIS_MUX('A',22,1) /* PTA22 */
#define FTM4_CH4_PTA22 KINETIS_MUX('A',22,2) /* PTA22 */
#define FXIO_D1_PTA22 KINETIS_MUX('A',22,3) /* PTA22 */
#define LPSPI1_PCS1_PTA22 KINETIS_MUX('A',22,4) /* PTA22 */
#define PTA23 KINETIS_MUX('A',23,1) /* PTA23 */
#define FTM4_CH6_PTA23 KINETIS_MUX('A',23,2) /* PTA23 */
#define FXIO_D2_PTA23 KINETIS_MUX('A',23,3) /* PTA23 */
#define PTA24 KINETIS_MUX('A',24,1) /* PTA24 */
#define FTM4_CH7_PTA24 KINETIS_MUX('A',24,2) /* PTA24 */
#define FXIO_D3_PTA24 KINETIS_MUX('A',24,3) /* PTA24 */
#define PTA25 KINETIS_MUX('A',25,1) /* PTA25 */
#define FTM5_CH0_PTA25 KINETIS_MUX('A',25,2) /* PTA25 */
#define PTA26 KINETIS_MUX('A',26,1) /* PTA26 */
#define FTM5_CH1_PTA26 KINETIS_MUX('A',26,2) /* PTA26 */
#define LPSPI1_PCS0_PTA26 KINETIS_MUX('A',26,3) /* PTA26 */
#define LPSPI0_PCS0_PTA26 KINETIS_MUX('A',26,4) /* PTA26 */
#define PTA27 KINETIS_MUX('A',27,1) /* PTA27 */
#define FTM5_CH2_PTA27 KINETIS_MUX('A',27,2) /* PTA27 */
#define LPSPI1_SOUT_PTA27 KINETIS_MUX('A',27,3) /* PTA27 */
#define LPUART0_TX_PTA27 KINETIS_MUX('A',27,4) /* PTA27 */
#define CAN0_TX_PTA27 KINETIS_MUX('A',27,5) /* PTA27 */
#define PTA28 KINETIS_MUX('A',28,1) /* PTA28 */
#define FTM5_CH3_PTA28 KINETIS_MUX('A',28,2) /* PTA28 */
#define LPSPI1_SCK_PTA28 KINETIS_MUX('A',28,3) /* PTA28 */
#define LPUART0_RX_PTA28 KINETIS_MUX('A',28,4) /* PTA28 */
#define CAN0_RX_PTA28 KINETIS_MUX('A',28,5) /* PTA28 */
#define PTA29 KINETIS_MUX('A',29,1) /* PTA29 */
#define FTM5_CH4_PTA29 KINETIS_MUX('A',29,2) /* PTA29 */
#define LPUART2_TX_PTA29 KINETIS_MUX('A',29,4) /* PTA29 */
#define LPSPI1_SIN_PTA29 KINETIS_MUX('A',29,5) /* PTA29 */
#define PTA30 KINETIS_MUX('A',30,1) /* PTA30 */
#define FTM5_CH5_PTA30 KINETIS_MUX('A',30,2) /* PTA30 */
#define LPUART2_RX_PTA30 KINETIS_MUX('A',30,3) /* PTA30 */
#define LPSPI0_SOUT_PTA30 KINETIS_MUX('A',30,4) /* PTA30 */
#define PTA31 KINETIS_MUX('A',31,1) /* PTA31 */
#define FTM5_CH6_PTA31 KINETIS_MUX('A',31,2) /* PTA31 */
#define LPSPI0_PCS1_PTA31 KINETIS_MUX('A',31,4) /* PTA31 */
#define ADC0_SE4_PTB0 KINETIS_MUX('B',0,0) /* PTB0 */
#define ADC1_SE14_PTB0 KINETIS_MUX('B',0,0) /* PTB0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB0 */
#define LPUART0_RX_PTB0 KINETIS_MUX('B',0,2) /* PTB0 */
#define LPSPI0_PCS0_PTB0 KINETIS_MUX('B',0,3) /* PTB0 */
#define LPTMR0_ALT3_PTB0 KINETIS_MUX('B',0,4) /* PTB0 */
#define CAN0_RX_PTB0 KINETIS_MUX('B',0,5) /* PTB0 */
#define FTM4_CH6_PTB0 KINETIS_MUX('B',0,6) /* PTB0 */
#define ADC0_SE5_PTB1 KINETIS_MUX('B',1,0) /* PTB1 */
#define ADC1_SE15_PTB1 KINETIS_MUX('B',1,0) /* PTB1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB1 */
#define LPUART0_TX_PTB1 KINETIS_MUX('B',1,2) /* PTB1 */
#define LPSPI0_SOUT_PTB1 KINETIS_MUX('B',1,3) /* PTB1 */
#define TCLK0_PTB1 KINETIS_MUX('B',1,4) /* PTB1 */
#define CAN0_TX_PTB1 KINETIS_MUX('B',1,5) /* PTB1 */
#define FTM4_CH5_PTB1 KINETIS_MUX('B',1,6) /* PTB1 */
#define ADC0_SE6_PTB2 KINETIS_MUX('B',2,0) /* PTB2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB2 */
#define FTM1_CH0_PTB2 KINETIS_MUX('B',2,2) /* PTB2 */
#define LPSPI0_SCK_PTB2 KINETIS_MUX('B',2,3) /* PTB2 */
#define FTM1_QD_PHB_PTB2 KINETIS_MUX('B',2,4) /* PTB2 */
#define TRGMUX_IN3_PTB2 KINETIS_MUX('B',2,6) /* PTB2 */
#define ADC0_SE7_PTB3 KINETIS_MUX('B',3,0) /* PTB3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB3 */
#define FTM1_CH1_PTB3 KINETIS_MUX('B',3,2) /* PTB3 */
#define LPSPI0_SIN_PTB3 KINETIS_MUX('B',3,3) /* PTB3 */
#define FTM1_QD_PHA_PTB3 KINETIS_MUX('B',3,4) /* PTB3 */
#define TRGMUX_IN2_PTB3 KINETIS_MUX('B',3,6) /* PTB3 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB4 */
#define FTM0_CH4_PTB4 KINETIS_MUX('B',4,2) /* PTB4 */
#define LPSPI0_SOUT_PTB4 KINETIS_MUX('B',4,3) /* PTB4 */
#define MII_RMII_MDIO_PTB4 KINETIS_MUX('B',4,5) /* PTB4 */
#define TRGMUX_IN1_PTB4 KINETIS_MUX('B',4,6) /* PTB4 */
#define QSPI_B_IO0_PTB4 KINETIS_MUX('B',4,7) /* PTB4 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB5 */
#define FTM0_CH5_PTB5 KINETIS_MUX('B',5,2) /* PTB5 */
#define LPSPI0_PCS1_PTB5 KINETIS_MUX('B',5,3) /* PTB5 */
#define LPSPI0_PCS0_PTB5 KINETIS_MUX('B',5,4) /* PTB5 */
#define CLKOUT_PTB5 KINETIS_MUX('B',5,5) /* PTB5 */
#define TRGMUX_IN0_PTB5 KINETIS_MUX('B',5,6) /* PTB5 */
#define MII_RMII_MDC_PTB5 KINETIS_MUX('B',5,7) /* PTB5 */
#define XTAL_PTB6 KINETIS_MUX('B',6,0) /* PTB6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB6 */
#define LPI2C0_SDA_PTB6 KINETIS_MUX('B',6,2) /* PTB6 */
#define EXTAL_PTB7 KINETIS_MUX('B',7,0) /* PTB7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB7 */
#define LPI2C0_SCL_PTB7 KINETIS_MUX('B',7,2) /* PTB7 */
#define PTB8 KINETIS_MUX('B',8,1) /* PTB8 */
#define FTM3_CH0_PTB8 KINETIS_MUX('B',8,2) /* PTB8 */
#define SAI1_BCLK_PTB8 KINETIS_MUX('B',8,4) /* PTB8 */
#define PTB9 KINETIS_MUX('B',9,1) /* PTB9 */
#define FTM3_CH1_PTB9 KINETIS_MUX('B',9,2) /* PTB9 */
#define LPI2C0_SCLS_PTB9 KINETIS_MUX('B',9,3) /* PTB9 */
#define SAI1_D0_PTB9 KINETIS_MUX('B',9,4) /* PTB9 */
#define PTB10 KINETIS_MUX('B',10,1) /* PTB10 */
#define FTM3_CH2_PTB10 KINETIS_MUX('B',10,2) /* PTB10 */
#define LPI2C0_SDAS_PTB10 KINETIS_MUX('B',10,3) /* PTB10 */
#define SAI1_MCLK_PTB10 KINETIS_MUX('B',10,4) /* PTB10 */
#define PTB11 KINETIS_MUX('B',11,1) /* PTB11 */
#define FTM3_CH3_PTB11 KINETIS_MUX('B',11,2) /* PTB11 */
#define LPI2C0_HREQ_PTB11 KINETIS_MUX('B',11,3) /* PTB11 */
#define ADC1_SE7_PTB12 KINETIS_MUX('B',12,0) /* PTB12 */
#define PTB12 KINETIS_MUX('B',12,1) /* PTB12 */
#define FTM0_CH0_PTB12 KINETIS_MUX('B',12,2) /* PTB12 */
#define FTM3_FLT2_PTB12 KINETIS_MUX('B',12,3) /* PTB12 */
#define CAN2_RX_PTB12 KINETIS_MUX('B',12,4) /* PTB12 */
#define FTM6_FLT1_PTB12 KINETIS_MUX('B',12,5) /* PTB12 */
#define ADC0_SE8_PTB13 KINETIS_MUX('B',13,0) /* PTB13 */
#define ADC1_SE8_PTB13 KINETIS_MUX('B',13,0) /* PTB13 */
#define PTB13 KINETIS_MUX('B',13,1) /* PTB13 */
#define FTM0_CH1_PTB13 KINETIS_MUX('B',13,2) /* PTB13 */
#define FTM3_FLT1_PTB13 KINETIS_MUX('B',13,3) /* PTB13 */
#define CAN2_TX_PTB13 KINETIS_MUX('B',13,4) /* PTB13 */
#define FTM6_FLT0_PTB13 KINETIS_MUX('B',13,5) /* PTB13 */
#define ADC1_SE9_PTB14 KINETIS_MUX('B',14,0) /* PTB14 */
#define ADC0_SE9_PTB14 KINETIS_MUX('B',14,0) /* PTB14 */
#define PTB14 KINETIS_MUX('B',14,1) /* PTB14 */
#define FTM0_CH2_PTB14 KINETIS_MUX('B',14,2) /* PTB14 */
#define LPSPI1_SCK_PTB14 KINETIS_MUX('B',14,3) /* PTB14 */
#define ADC1_SE14_PTB15 KINETIS_MUX('B',15,0) /* PTB15 */
#define PTB15 KINETIS_MUX('B',15,1) /* PTB15 */
#define FTM0_CH3_PTB15 KINETIS_MUX('B',15,2) /* PTB15 */
#define LPSPI1_SIN_PTB15 KINETIS_MUX('B',15,3) /* PTB15 */
#define ADC1_SE15_PTB16 KINETIS_MUX('B',16,0) /* PTB16 */
#define PTB16 KINETIS_MUX('B',16,1) /* PTB16 */
#define FTM0_CH4_PTB16 KINETIS_MUX('B',16,2) /* PTB16 */
#define LPSPI1_SOUT_PTB16 KINETIS_MUX('B',16,3) /* PTB16 */
#define PTB17 KINETIS_MUX('B',17,1) /* PTB17 */
#define FTM0_CH5_PTB17 KINETIS_MUX('B',17,2) /* PTB17 */
#define LPSPI1_PCS3_PTB17 KINETIS_MUX('B',17,3) /* PTB17 */
#define FTM5_FLT1_PTB17 KINETIS_MUX('B',17,4) /* PTB17 */
#define ADC0_SE16_PTB18 KINETIS_MUX('B',18,0) /* PTB18 */
#define PTB18 KINETIS_MUX('B',18,1) /* PTB18 */
#define FTM5_CH7_PTB18 KINETIS_MUX('B',18,2) /* PTB18 */
#define LPSPI1_PCS1_PTB18 KINETIS_MUX('B',18,4) /* PTB18 */
#define PTB19 KINETIS_MUX('B',19,1) /* PTB19 */
#define FTM5_CH7_PTB19 KINETIS_MUX('B',19,2) /* PTB19 */
#define ADC0_SE17_PTB20 KINETIS_MUX('B',20,0) /* PTB20 */
#define PTB20 KINETIS_MUX('B',20,1) /* PTB20 */
#define FTM6_CH0_PTB20 KINETIS_MUX('B',20,2) /* PTB20 */
#define ADC0_SE18_PTB21 KINETIS_MUX('B',21,0) /* PTB21 */
#define PTB21 KINETIS_MUX('B',21,1) /* PTB21 */
#define FTM6_CH1_PTB21 KINETIS_MUX('B',21,2) /* PTB21 */
#define ADC0_SE19_PTB22 KINETIS_MUX('B',22,0) /* PTB22 */
#define PTB22 KINETIS_MUX('B',22,1) /* PTB22 */
#define FTM6_CH2_PTB22 KINETIS_MUX('B',22,2) /* PTB22 */
#define MII_CRS_PTB22 KINETIS_MUX('B',22,3) /* PTB22 */
#define LPUART1_TX_PTB22 KINETIS_MUX('B',22,5) /* PTB22 */
#define ADC0_SE20_PTB23 KINETIS_MUX('B',23,0) /* PTB23 */
#define PTB23 KINETIS_MUX('B',23,1) /* PTB23 */
#define FTM6_CH3_PTB23 KINETIS_MUX('B',23,2) /* PTB23 */
#define LPUART1_RX_PTB23 KINETIS_MUX('B',23,3) /* PTB23 */
#define MII_COL_PTB23 KINETIS_MUX('B',23,4) /* PTB23 */
#define PTB24 KINETIS_MUX('B',24,1) /* PTB24 */
#define FTM6_CH4_PTB24 KINETIS_MUX('B',24,2) /* PTB24 */
#define ADC0_SE21_PTB25 KINETIS_MUX('B',25,0) /* PTB25 */
#define PTB25 KINETIS_MUX('B',25,1) /* PTB25 */
#define FTM6_CH5_PTB25 KINETIS_MUX('B',25,2) /* PTB25 */
#define LPSPI2_PCS0_PTB25 KINETIS_MUX('B',25,5) /* PTB25 */
#define PTB26 KINETIS_MUX('B',26,1) /* PTB26 */
#define FTM6_CH6_PTB26 KINETIS_MUX('B',26,2) /* PTB26 */
#define ADC0_SE22_PTB27 KINETIS_MUX('B',27,0) /* PTB27 */
#define PTB27 KINETIS_MUX('B',27,1) /* PTB27 */
#define FTM6_CH7_PTB27 KINETIS_MUX('B',27,2) /* PTB27 */
#define LPSPI2_SOUT_PTB27 KINETIS_MUX('B',27,5) /* PTB27 */
#define ADC0_SE23_PTB28 KINETIS_MUX('B',28,0) /* PTB28 */
#define PTB28 KINETIS_MUX('B',28,1) /* PTB28 */
#define FTM7_CH0_PTB28 KINETIS_MUX('B',28,2) /* PTB28 */
#define LPSPI2_SIN_PTB28 KINETIS_MUX('B',28,5) /* PTB28 */
#define ADC0_SE24_PTB29 KINETIS_MUX('B',29,0) /* PTB29 */
#define PTB29 KINETIS_MUX('B',29,1) /* PTB29 */
#define FTM7_CH1_PTB29 KINETIS_MUX('B',29,2) /* PTB29 */
#define LPSPI2_SCK_PTB29 KINETIS_MUX('B',29,5) /* PTB29 */
#define PTB30 KINETIS_MUX('B',30,1) /* PTB30 */
#define FTM7_CH2_PTB30 KINETIS_MUX('B',30,2) /* PTB30 */
#define PTB31 KINETIS_MUX('B',31,1) /* PTB31 */
#define FTM7_CH3_PTB31 KINETIS_MUX('B',31,2) /* PTB31 */
#define ADC0_SE8_PTC0 KINETIS_MUX('C',0,0) /* PTC0 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC0 */
#define FTM0_CH0_PTC0 KINETIS_MUX('C',0,2) /* PTC0 */
#define LPSPI2_SIN_PTC0 KINETIS_MUX('C',0,3) /* PTC0 */
#define MII_RMII_RXD1_PTC0 KINETIS_MUX('C',0,4) /* PTC0 */
#define MII_RMII_RXD0_PTC0 KINETIS_MUX('C',0,5) /* PTC0 */
#define FTM1_CH6_PTC0 KINETIS_MUX('C',0,6) /* PTC0 */
#define QSPI_B_RWDS_PTC0 KINETIS_MUX('C',0,7) /* PTC0 */
#define ADC0_SE9_PTC1 KINETIS_MUX('C',1,0) /* PTC1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC1 */
#define FTM0_CH1_PTC1 KINETIS_MUX('C',1,2) /* PTC1 */
#define LPSPI2_SOUT_PTC1 KINETIS_MUX('C',1,3) /* PTC1 */
#define MII_RMII_RXD1_PTC1 KINETIS_MUX('C',1,4) /* PTC1 */
#define MII_RMII_RXD0_PTC1 KINETIS_MUX('C',1,5) /* PTC1 */
#define FTM1_CH7_PTC1 KINETIS_MUX('C',1,6) /* PTC1 */
#define QSPI_B_SCK_PTC1 KINETIS_MUX('C',1,7) /* PTC1 */
#define ADC0_SE10_PTC2 KINETIS_MUX('C',2,0) /* PTC2 */
#define CMP0_IN5_PTC2 KINETIS_MUX('C',2,0) /* PTC2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC2 */
#define FTM0_CH2_PTC2 KINETIS_MUX('C',2,2) /* PTC2 */
#define CAN0_RX_PTC2 KINETIS_MUX('C',2,3) /* PTC2 */
#define LPUART0_RX_PTC2 KINETIS_MUX('C',2,4) /* PTC2 */
#define MII_RMII_TXD0_PTC2 KINETIS_MUX('C',2,5) /* PTC2 */
#define ETM_TRACE_CLKOUT_PTC2 KINETIS_MUX('C',2,6) /* PTC2 */
#define QSPI_A_IO3_PTC2 KINETIS_MUX('C',2,7) /* PTC2 */
#define CMP0_IN4_PTC3 KINETIS_MUX('C',3,0) /* PTC3 */
#define ADC0_SE11_PTC3 KINETIS_MUX('C',3,0) /* PTC3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC3 */
#define FTM0_CH3_PTC3 KINETIS_MUX('C',3,2) /* PTC3 */
#define CAN0_TX_PTC3 KINETIS_MUX('C',3,3) /* PTC3 */
#define LPUART0_TX_PTC3 KINETIS_MUX('C',3,4) /* PTC3 */
#define MII_TX_ER_PTC3 KINETIS_MUX('C',3,5) /* PTC3 */
#define QSPI_A_CS_PTC3 KINETIS_MUX('C',3,6) /* PTC3 */
#define QSPI_B_IO3_PTC3 KINETIS_MUX('C',3,7) /* PTC3 */
#define CMP0_IN2_PTC4 KINETIS_MUX('C',4,0) /* PTC4 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC4 */
#define FTM1_CH0_PTC4 KINETIS_MUX('C',4,2) /* PTC4 */
#define RTC_CLKOUT_PTC4 KINETIS_MUX('C',4,3) /* PTC4 */
#define EWM_IN_PTC4 KINETIS_MUX('C',4,5) /* PTC4 */
#define FTM1_QD_PHB_PTC4 KINETIS_MUX('C',4,6) /* PTC4 */
#define JTAG_TCLK_PTC4 KINETIS_MUX('C',4,7) /* PTC4 */
#define SWD_CLK_PTC4 KINETIS_MUX('C',4,7) /* PTC4 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC5 */
#define FTM2_CH0_PTC5 KINETIS_MUX('C',5,2) /* PTC5 */
#define RTC_CLKOUT_PTC5 KINETIS_MUX('C',5,3) /* PTC5 */
#define LPI2C1_HREQ_PTC5 KINETIS_MUX('C',5,4) /* PTC5 */
#define FTM2_QD_PHB_PTC5 KINETIS_MUX('C',5,6) /* PTC5 */
#define JTAG_TDI_PTC5 KINETIS_MUX('C',5,7) /* PTC5 */
#define ADC1_SE4_PTC6 KINETIS_MUX('C',6,0) /* PTC6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC6 */
#define LPUART1_RX_PTC6 KINETIS_MUX('C',6,2) /* PTC6 */
#define CAN1_RX_PTC6 KINETIS_MUX('C',6,3) /* PTC6 */
#define FTM3_CH2_PTC6 KINETIS_MUX('C',6,4) /* PTC6 */
#define FTM1_QD_PHB_PTC6 KINETIS_MUX('C',6,6) /* PTC6 */
#define ADC1_SE5_PTC7 KINETIS_MUX('C',7,0) /* PTC7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC7 */
#define LPUART1_TX_PTC7 KINETIS_MUX('C',7,2) /* PTC7 */
#define CAN1_TX_PTC7 KINETIS_MUX('C',7,3) /* PTC7 */
#define FTM3_CH3_PTC7 KINETIS_MUX('C',7,4) /* PTC7 */
#define FTM1_QD_PHA_PTC7 KINETIS_MUX('C',7,6) /* PTC7 */
#define PTC8 KINETIS_MUX('C',8,1) /* PTC8 */
#define LPUART1_RX_PTC8 KINETIS_MUX('C',8,2) /* PTC8 */
#define FTM1_FLT0_PTC8 KINETIS_MUX('C',8,3) /* PTC8 */
#define FTM5_CH1_PTC8 KINETIS_MUX('C',8,4) /* PTC8 */
#define LPUART0_CTS_PTC8 KINETIS_MUX('C',8,6) /* PTC8 */
#define PTC9 KINETIS_MUX('C',9,1) /* PTC9 */
#define LPUART1_TX_PTC9 KINETIS_MUX('C',9,2) /* PTC9 */
#define FTM1_FLT1_PTC9 KINETIS_MUX('C',9,3) /* PTC9 */
#define FTM5_CH0_PTC9 KINETIS_MUX('C',9,4) /* PTC9 */
#define LPUART0_RTS_PTC9 KINETIS_MUX('C',9,6) /* PTC9 */
#define PTC10 KINETIS_MUX('C',10,1) /* PTC10 */
#define FTM3_CH4_PTC10 KINETIS_MUX('C',10,2) /* PTC10 */
#define TRGMUX_IN11_PTC10 KINETIS_MUX('C',10,6) /* PTC10 */
#define PTC11 KINETIS_MUX('C',11,1) /* PTC11 */
#define FTM3_CH5_PTC11 KINETIS_MUX('C',11,2) /* PTC11 */
#define FTM4_CH2_PTC11 KINETIS_MUX('C',11,3) /* PTC11 */
#define TRGMUX_IN10_PTC11 KINETIS_MUX('C',11,6) /* PTC11 */
#define PTC12 KINETIS_MUX('C',12,1) /* PTC12 */
#define FTM3_CH6_PTC12 KINETIS_MUX('C',12,2) /* PTC12 */
#define FTM2_CH6_PTC12 KINETIS_MUX('C',12,3) /* PTC12 */
#define LPUART2_CTS_PTC12 KINETIS_MUX('C',12,4) /* PTC12 */
#define PTC13 KINETIS_MUX('C',13,1) /* PTC13 */
#define FTM3_CH7_PTC13 KINETIS_MUX('C',13,2) /* PTC13 */
#define FTM2_CH7_PTC13 KINETIS_MUX('C',13,3) /* PTC13 */
#define LPUART2_RTS_PTC13 KINETIS_MUX('C',13,4) /* PTC13 */
#define ADC0_SE12_PTC14 KINETIS_MUX('C',14,0) /* PTC14 */
#define PTC14 KINETIS_MUX('C',14,1) /* PTC14 */
#define FTM1_CH2_PTC14 KINETIS_MUX('C',14,2) /* PTC14 */
#define LPSPI2_PCS0_PTC14 KINETIS_MUX('C',14,3) /* PTC14 */
#define MII_COL_PTC14 KINETIS_MUX('C',14,4) /* PTC14 */
#define TRGMUX_IN9_PTC14 KINETIS_MUX('C',14,6) /* PTC14 */
#define ADC0_SE13_PTC15 KINETIS_MUX('C',15,0) /* PTC15 */
#define PTC15 KINETIS_MUX('C',15,1) /* PTC15 */
#define FTM1_CH3_PTC15 KINETIS_MUX('C',15,2) /* PTC15 */
#define LPSPI2_SCK_PTC15 KINETIS_MUX('C',15,3) /* PTC15 */
#define MII_CRS_PTC15 KINETIS_MUX('C',15,4) /* PTC15 */
#define TRGMUX_IN8_PTC15 KINETIS_MUX('C',15,6) /* PTC15 */
#define QSPI_B_CS_PTC15 KINETIS_MUX('C',15,7) /* PTC15 */
#define ADC0_SE14_PTC16 KINETIS_MUX('C',16,0) /* PTC16 */
#define PTC16 KINETIS_MUX('C',16,1) /* PTC16 */
#define FTM1_FLT2_PTC16 KINETIS_MUX('C',16,2) /* PTC16 */
#define CAN2_RX_PTC16 KINETIS_MUX('C',16,3) /* PTC16 */
#define LPI2C1_SDAS_PTC16 KINETIS_MUX('C',16,4) /* PTC16 */
#define MII_RMII_RX_ER_PTC16 KINETIS_MUX('C',16,5) /* PTC16 */
#define QSPI_B_IO7_PTC16 KINETIS_MUX('C',16,7) /* PTC16 */
#define ADC0_SE15_PTC17 KINETIS_MUX('C',17,0) /* PTC17 */
#define PTC17 KINETIS_MUX('C',17,1) /* PTC17 */
#define FTM1_FLT3_PTC17 KINETIS_MUX('C',17,2) /* PTC17 */
#define CAN2_TX_PTC17 KINETIS_MUX('C',17,3) /* PTC17 */
#define LPI2C1_SCLS_PTC17 KINETIS_MUX('C',17,4) /* PTC17 */
#define MII_RMII_RX_DV_PTC17 KINETIS_MUX('C',17,5) /* PTC17 */
#define QSPI_B_IO6_PTC17 KINETIS_MUX('C',17,7) /* PTC17 */
#define PTC18 KINETIS_MUX('C',18,1) /* PTC18 */
#define FTM7_CH4_PTC18 KINETIS_MUX('C',18,2) /* PTC18 */
#define ADC0_SE25_PTC19 KINETIS_MUX('C',19,0) /* PTC19 */
#define PTC19 KINETIS_MUX('C',19,1) /* PTC19 */
#define FTM7_CH5_PTC19 KINETIS_MUX('C',19,2) /* PTC19 */
#define LPSPI2_PCS1_PTC19 KINETIS_MUX('C',19,5) /* PTC19 */
#define PTC20 KINETIS_MUX('C',20,1) /* PTC20 */
#define FTM7_CH6_PTC20 KINETIS_MUX('C',20,2) /* PTC20 */
#define PTC21 KINETIS_MUX('C',21,1) /* PTC21 */
#define FTM7_CH7_PTC21 KINETIS_MUX('C',21,2) /* PTC21 */
#define FTM7_FLT0_PTC21 KINETIS_MUX('C',21,4) /* PTC21 */
#define PTC22 KINETIS_MUX('C',22,1) /* PTC22 */
#define FTM7_FLT1_PTC22 KINETIS_MUX('C',22,2) /* PTC22 */
#define ADC0_SE26_PTC23 KINETIS_MUX('C',23,0) /* PTC23 */
#define PTC23 KINETIS_MUX('C',23,1) /* PTC23 */
#define LPSPI0_SCK_PTC23 KINETIS_MUX('C',23,2) /* PTC23 */
#define PTC24 KINETIS_MUX('C',24,1) /* PTC24 */
#define FTM4_CH0_PTC24 KINETIS_MUX('C',24,2) /* PTC24 */
#define PTC25 KINETIS_MUX('C',25,1) /* PTC25 */
#define FTM4_CH1_PTC25 KINETIS_MUX('C',25,2) /* PTC25 */
#define PTC26 KINETIS_MUX('C',26,1) /* PTC26 */
#define FTM4_CH3_PTC26 KINETIS_MUX('C',26,2) /* PTC26 */
