zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K148_LQFP176-pinctrl.h
#define ADC0_SE27_PTC27 KINETIS_MUX('C',27,0) /* PTC27 */
#define PTC27 KINETIS_MUX('C',27,1) /* PTC27 */
#define FTM4_CH4_PTC27 KINETIS_MUX('C',27,2) /* PTC27 */
#define ADC0_SE28_PTC28 KINETIS_MUX('C',28,0) /* PTC28 */
#define PTC28 KINETIS_MUX('C',28,1) /* PTC28 */
#define FTM4_CH7_PTC28 KINETIS_MUX('C',28,2) /* PTC28 */
#define ADC0_SE29_PTC29 KINETIS_MUX('C',29,0) /* PTC29 */
#define PTC29 KINETIS_MUX('C',29,1) /* PTC29 */
#define FTM5_CH2_PTC29 KINETIS_MUX('C',29,2) /* PTC29 */
#define ADC0_SE30_PTC30 KINETIS_MUX('C',30,0) /* PTC30 */
#define PTC30 KINETIS_MUX('C',30,1) /* PTC30 */
#define FTM5_CH4_PTC30 KINETIS_MUX('C',30,2) /* PTC30 */
#define FXIO_D0_PTC30 KINETIS_MUX('C',30,3) /* PTC30 */
#define LPI2C1_SDAS_PTC30 KINETIS_MUX('C',30,4) /* PTC30 */
#define ADC0_SE31_PTC31 KINETIS_MUX('C',31,0) /* PTC31 */
#define PTC31 KINETIS_MUX('C',31,1) /* PTC31 */
#define FTM5_CH6_PTC31 KINETIS_MUX('C',31,2) /* PTC31 */
#define FXIO_D1_PTC31 KINETIS_MUX('C',31,3) /* PTC31 */
#define LPI2C1_SDA_PTC31 KINETIS_MUX('C',31,4) /* PTC31 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD0 */
#define FTM0_CH2_PTD0 KINETIS_MUX('D',0,2) /* PTD0 */
#define LPSPI1_SCK_PTD0 KINETIS_MUX('D',0,3) /* PTD0 */
#define FTM2_CH0_PTD0 KINETIS_MUX('D',0,4) /* PTD0 */
#define ETM_TRACE_D0_PTD0 KINETIS_MUX('D',0,5) /* PTD0 */
#define FXIO_D0_PTD0 KINETIS_MUX('D',0,6) /* PTD0 */
#define TRGMUX_OUT1_PTD0 KINETIS_MUX('D',0,7) /* PTD0 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD1 */
#define FTM0_CH3_PTD1 KINETIS_MUX('D',1,2) /* PTD1 */
#define LPSPI1_SIN_PTD1 KINETIS_MUX('D',1,3) /* PTD1 */
#define FTM2_CH1_PTD1 KINETIS_MUX('D',1,4) /* PTD1 */
#define SAI0_MCLK_PTD1 KINETIS_MUX('D',1,5) /* PTD1 */
#define FXIO_D1_PTD1 KINETIS_MUX('D',1,6) /* PTD1 */
#define TRGMUX_OUT2_PTD1 KINETIS_MUX('D',1,7) /* PTD1 */
#define ADC1_SE2_PTD2 KINETIS_MUX('D',2,0) /* PTD2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD2 */
#define FTM3_CH4_PTD2 KINETIS_MUX('D',2,2) /* PTD2 */
#define LPSPI1_SOUT_PTD2 KINETIS_MUX('D',2,3) /* PTD2 */
#define FXIO_D4_PTD2 KINETIS_MUX('D',2,4) /* PTD2 */
#define FXIO_D6_PTD2 KINETIS_MUX('D',2,5) /* PTD2 */
#define TRGMUX_IN5_PTD2 KINETIS_MUX('D',2,6) /* PTD2 */
#define ADC1_SE3_PTD3 KINETIS_MUX('D',3,0) /* PTD3 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD3 */
#define FTM3_CH5_PTD3 KINETIS_MUX('D',3,2) /* PTD3 */
#define LPSPI1_PCS0_PTD3 KINETIS_MUX('D',3,3) /* PTD3 */
#define FXIO_D5_PTD3 KINETIS_MUX('D',3,4) /* PTD3 */
#define FXIO_D7_PTD3 KINETIS_MUX('D',3,5) /* PTD3 */
#define TRGMUX_IN4_PTD3 KINETIS_MUX('D',3,6) /* PTD3 */
#define NMI_b_PTD3 KINETIS_MUX('D',3,7) /* PTD3 */
#define ADC1_SE6_PTD4 KINETIS_MUX('D',4,0) /* PTD4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD4 */
#define FTM0_FLT3_PTD4 KINETIS_MUX('D',4,2) /* PTD4 */
#define FTM3_FLT3_PTD4 KINETIS_MUX('D',4,3) /* PTD4 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD5 */
#define FTM2_CH3_PTD5 KINETIS_MUX('D',5,2) /* PTD5 */
#define LPTMR0_ALT2_PTD5 KINETIS_MUX('D',5,3) /* PTD5 */
#define FTM2_FLT1_PTD5 KINETIS_MUX('D',5,4) /* PTD5 */
#define MII_TXD3_PTD5 KINETIS_MUX('D',5,5) /* PTD5 */
#define TRGMUX_IN7_PTD5 KINETIS_MUX('D',5,6) /* PTD5 */
#define QSPI_B_IO2_PTD5 KINETIS_MUX('D',5,7) /* PTD5 */
#define CMP0_IN7_PTD6 KINETIS_MUX('D',6,0) /* PTD6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD6 */
#define LPUART2_RX_PTD6 KINETIS_MUX('D',6,2) /* PTD6 */
#define FTM2_FLT2_PTD6 KINETIS_MUX('D',6,4) /* PTD6 */
#define MII_TXD2_PTD6 KINETIS_MUX('D',6,5) /* PTD6 */
#define QSPI_B_IO1_PTD6 KINETIS_MUX('D',6,7) /* PTD6 */
#define CMP0_IN6_PTD7 KINETIS_MUX('D',7,0) /* PTD7 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD7 */
#define LPUART2_TX_PTD7 KINETIS_MUX('D',7,2) /* PTD7 */
#define FTM2_FLT3_PTD7 KINETIS_MUX('D',7,4) /* PTD7 */
#define MII_RMII_TXD1_PTD7 KINETIS_MUX('D',7,5) /* PTD7 */
#define ETM_TRACE_D0_PTD7 KINETIS_MUX('D',7,6) /* PTD7 */
#define QSPI_A_IO1_PTD7 KINETIS_MUX('D',7,7) /* PTD7 */
#define PTD8 KINETIS_MUX('D',8,1) /* PTD8 */
#define LPI2C1_SDA_PTD8 KINETIS_MUX('D',8,2) /* PTD8 */
#define MII_RXD3_PTD8 KINETIS_MUX('D',8,3) /* PTD8 */
#define FTM2_FLT2_PTD8 KINETIS_MUX('D',8,4) /* PTD8 */
#define FXIO_D1_PTD8 KINETIS_MUX('D',8,5) /* PTD8 */
#define FTM1_CH4_PTD8 KINETIS_MUX('D',8,6) /* PTD8 */
#define QSPI_B_IO5_PTD8 KINETIS_MUX('D',8,7) /* PTD8 */
#define PTD9 KINETIS_MUX('D',9,1) /* PTD9 */
#define LPI2C1_SCL_PTD9 KINETIS_MUX('D',9,2) /* PTD9 */
#define FXIO_D0_PTD9 KINETIS_MUX('D',9,3) /* PTD9 */
#define FTM2_FLT3_PTD9 KINETIS_MUX('D',9,4) /* PTD9 */
#define MII_RXD2_PTD9 KINETIS_MUX('D',9,5) /* PTD9 */
#define FTM1_CH5_PTD9 KINETIS_MUX('D',9,6) /* PTD9 */
#define QSPI_B_IO4_PTD9 KINETIS_MUX('D',9,7) /* PTD9 */
#define PTD10 KINETIS_MUX('D',10,1) /* PTD10 */
#define FTM2_CH0_PTD10 KINETIS_MUX('D',10,2) /* PTD10 */
#define FTM2_QD_PHB_PTD10 KINETIS_MUX('D',10,3) /* PTD10 */
#define ETM_TRACE_D3_PTD10 KINETIS_MUX('D',10,4) /* PTD10 */
#define MII_RX_CLK_PTD10 KINETIS_MUX('D',10,5) /* PTD10 */
#define CLKOUT_PTD10 KINETIS_MUX('D',10,6) /* PTD10 */
#define QSPI_A_SCK_PTD10 KINETIS_MUX('D',10,7) /* PTD10 */
#define PTD11 KINETIS_MUX('D',11,1) /* PTD11 */
#define FTM2_CH1_PTD11 KINETIS_MUX('D',11,2) /* PTD11 */
#define FTM2_QD_PHA_PTD11 KINETIS_MUX('D',11,3) /* PTD11 */
#define ETM_TRACE_D2_PTD11 KINETIS_MUX('D',11,4) /* PTD11 */
#define MII_RMII_TX_CLK_PTD11 KINETIS_MUX('D',11,5) /* PTD11 */
#define LPUART2_CTS_PTD11 KINETIS_MUX('D',11,6) /* PTD11 */
#define QSPI_A_IO0_PTD11 KINETIS_MUX('D',11,7) /* PTD11 */
#define PTD12 KINETIS_MUX('D',12,1) /* PTD12 */
#define FTM2_CH2_PTD12 KINETIS_MUX('D',12,2) /* PTD12 */
#define LPI2C1_HREQ_PTD12 KINETIS_MUX('D',12,3) /* PTD12 */
#define ETM_TRACE_D1_PTD12 KINETIS_MUX('D',12,4) /* PTD12 */
#define MII_RMII_TX_EN_PTD12 KINETIS_MUX('D',12,5) /* PTD12 */
#define LPUART2_RTS_PTD12 KINETIS_MUX('D',12,6) /* PTD12 */
#define QSPI_A_IO2_PTD12 KINETIS_MUX('D',12,7) /* PTD12 */
#define PTD13 KINETIS_MUX('D',13,1) /* PTD13 */
#define FTM2_CH4_PTD13 KINETIS_MUX('D',13,2) /* PTD13 */
#define LPUART1_RX_PTD13 KINETIS_MUX('D',13,3) /* PTD13 */
#define ENET_TMR1_PTD13 KINETIS_MUX('D',13,5) /* PTD13 */
#define RTC_CLKOUT_PTD13 KINETIS_MUX('D',13,7) /* PTD13 */
#define PTD14 KINETIS_MUX('D',14,1) /* PTD14 */
#define FTM2_CH5_PTD14 KINETIS_MUX('D',14,2) /* PTD14 */
#define LPUART1_TX_PTD14 KINETIS_MUX('D',14,3) /* PTD14 */
#define ENET_TMR0_PTD14 KINETIS_MUX('D',14,5) /* PTD14 */
#define CLKOUT_PTD14 KINETIS_MUX('D',14,7) /* PTD14 */
#define PTD15 KINETIS_MUX('D',15,1) /* PTD15 */
#define FTM0_CH0_PTD15 KINETIS_MUX('D',15,2) /* PTD15 */
#define ETM_TRACE_D3_PTD15 KINETIS_MUX('D',15,3) /* PTD15 */
#define LPSPI0_SCK_PTD15 KINETIS_MUX('D',15,4) /* PTD15 */
#define ENET_TMR2_PTD15 KINETIS_MUX('D',15,5) /* PTD15 */
#define PTD16 KINETIS_MUX('D',16,1) /* PTD16 */
#define FTM0_CH1_PTD16 KINETIS_MUX('D',16,2) /* PTD16 */
#define ETM_TRACE_D2_PTD16 KINETIS_MUX('D',16,3) /* PTD16 */
#define LPSPI0_SIN_PTD16 KINETIS_MUX('D',16,4) /* PTD16 */
#define CMP0_RRT_PTD16 KINETIS_MUX('D',16,5) /* PTD16 */
#define ETM_TRACE_CLKOUT_PTD16 KINETIS_MUX('D',16,6) /* PTD16 */
#define PTD17 KINETIS_MUX('D',17,1) /* PTD17 */
#define FTM0_FLT2_PTD17 KINETIS_MUX('D',17,2) /* PTD17 */
#define LPUART2_RX_PTD17 KINETIS_MUX('D',17,3) /* PTD17 */
#define FTM5_FLT1_PTD17 KINETIS_MUX('D',17,4) /* PTD17 */
#define ADC1_SE16_PTD18 KINETIS_MUX('D',18,0) /* PTD18 */
#define PTD18 KINETIS_MUX('D',18,1) /* PTD18 */
#define FTM5_CH7_PTD18 KINETIS_MUX('D',18,2) /* PTD18 */
#define FXIO_D2_PTD18 KINETIS_MUX('D',18,3) /* PTD18 */
#define LPI2C1_SCLS_PTD18 KINETIS_MUX('D',18,4) /* PTD18 */
#define ADC1_SE17_PTD19 KINETIS_MUX('D',19,0) /* PTD19 */
#define PTD19 KINETIS_MUX('D',19,1) /* PTD19 */
#define FTM6_CH0_PTD19 KINETIS_MUX('D',19,2) /* PTD19 */
#define FXIO_D3_PTD19 KINETIS_MUX('D',19,3) /* PTD19 */
#define LPI2C1_SCL_PTD19 KINETIS_MUX('D',19,4) /* PTD19 */
#define PTD20 KINETIS_MUX('D',20,1) /* PTD20 */
#define FTM6_CH1_PTD20 KINETIS_MUX('D',20,2) /* PTD20 */
#define PTD21 KINETIS_MUX('D',21,1) /* PTD21 */
#define FTM6_CH2_PTD21 KINETIS_MUX('D',21,2) /* PTD21 */
#define ADC1_SE18_PTD22 KINETIS_MUX('D',22,0) /* PTD22 */
#define PTD22 KINETIS_MUX('D',22,1) /* PTD22 */
#define FTM6_CH3_PTD22 KINETIS_MUX('D',22,2) /* PTD22 */
#define ADC1_SE19_PTD23 KINETIS_MUX('D',23,0) /* PTD23 */
#define PTD23 KINETIS_MUX('D',23,1) /* PTD23 */
#define FTM6_CH4_PTD23 KINETIS_MUX('D',23,2) /* PTD23 */
#define ADC1_SE20_PTD24 KINETIS_MUX('D',24,0) /* PTD24 */
#define PTD24 KINETIS_MUX('D',24,1) /* PTD24 */
#define FTM6_CH5_PTD24 KINETIS_MUX('D',24,2) /* PTD24 */
#define PTD25 KINETIS_MUX('D',25,1) /* PTD25 */
#define FTM6_CH6_PTD25 KINETIS_MUX('D',25,2) /* PTD25 */
#define PTD26 KINETIS_MUX('D',26,1) /* PTD26 */
#define FTM6_CH7_PTD26 KINETIS_MUX('D',26,2) /* PTD26 */
#define FXIO_D7_PTD26 KINETIS_MUX('D',26,3) /* PTD26 */
#define ADC1_SE21_PTD27 KINETIS_MUX('D',27,0) /* PTD27 */
#define PTD27 KINETIS_MUX('D',27,1) /* PTD27 */
#define FTM7_CH0_PTD27 KINETIS_MUX('D',27,2) /* PTD27 */
#define ADC1_SE22_PTD28 KINETIS_MUX('D',28,0) /* PTD28 */
#define PTD28 KINETIS_MUX('D',28,1) /* PTD28 */
#define FTM7_CH1_PTD28 KINETIS_MUX('D',28,2) /* PTD28 */
#define ADC1_SE23_PTD29 KINETIS_MUX('D',29,0) /* PTD29 */
#define PTD29 KINETIS_MUX('D',29,1) /* PTD29 */
#define FTM7_CH2_PTD29 KINETIS_MUX('D',29,2) /* PTD29 */
#define ADC1_SE24_PTD30 KINETIS_MUX('D',30,0) /* PTD30 */
#define PTD30 KINETIS_MUX('D',30,1) /* PTD30 */
#define FTM7_CH3_PTD30 KINETIS_MUX('D',30,2) /* PTD30 */
#define FTM6_FLT1_PTD30 KINETIS_MUX('D',30,3) /* PTD30 */
#define PTD31 KINETIS_MUX('D',31,1) /* PTD31 */
#define FTM7_CH4_PTD31 KINETIS_MUX('D',31,2) /* PTD31 */
#define FXIO_D6_PTD31 KINETIS_MUX('D',31,3) /* PTD31 */
#define FTM6_FLT0_PTD31 KINETIS_MUX('D',31,5) /* PTD31 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE0 */
#define LPSPI0_SCK_PTE0 KINETIS_MUX('E',0,2) /* PTE0 */
#define TCLK1_PTE0 KINETIS_MUX('E',0,3) /* PTE0 */
#define LPI2C1_SDA_PTE0 KINETIS_MUX('E',0,4) /* PTE0 */
#define LPSPI1_SOUT_PTE0 KINETIS_MUX('E',0,5) /* PTE0 */
#define FTM1_FLT2_PTE0 KINETIS_MUX('E',0,6) /* PTE0 */
#define SAI0_D2_PTE0 KINETIS_MUX('E',0,7) /* PTE0 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE1 */
#define LPSPI0_SIN_PTE1 KINETIS_MUX('E',1,2) /* PTE1 */
#define LPI2C0_HREQ_PTE1 KINETIS_MUX('E',1,3) /* PTE1 */
#define LPI2C1_SCL_PTE1 KINETIS_MUX('E',1,4) /* PTE1 */
#define LPSPI1_PCS0_PTE1 KINETIS_MUX('E',1,5) /* PTE1 */
#define FTM1_FLT1_PTE1 KINETIS_MUX('E',1,6) /* PTE1 */
#define SAI0_D1_PTE1 KINETIS_MUX('E',1,7) /* PTE1 */
#define ADC1_SE10_PTE2 KINETIS_MUX('E',2,0) /* PTE2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE2 */
#define LPSPI0_SOUT_PTE2 KINETIS_MUX('E',2,2) /* PTE2 */
#define LPTMR0_ALT3_PTE2 KINETIS_MUX('E',2,3) /* PTE2 */
#define FTM3_CH6_PTE2 KINETIS_MUX('E',2,4) /* PTE2 */
#define LPUART1_CTS_PTE2 KINETIS_MUX('E',2,6) /* PTE2 */
#define SAI1_SYNC_PTE2 KINETIS_MUX('E',2,7) /* PTE2 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE3 */
#define FTM0_FLT0_PTE3 KINETIS_MUX('E',3,2) /* PTE3 */
#define LPUART2_RTS_PTE3 KINETIS_MUX('E',3,3) /* PTE3 */
#define FTM2_FLT0_PTE3 KINETIS_MUX('E',3,4) /* PTE3 */
#define TRGMUX_IN6_PTE3 KINETIS_MUX('E',3,6) /* PTE3 */
#define CMP0_OUT_PTE3 KINETIS_MUX('E',3,7) /* PTE3 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define ETM_TRACE_D1_PTE4 KINETIS_MUX('E',4,2) /* PTE4 */
#define FTM2_QD_PHB_PTE4 KINETIS_MUX('E',4,3) /* PTE4 */
#define FTM2_CH2_PTE4 KINETIS_MUX('E',4,4) /* PTE4 */
#define CAN0_RX_PTE4 KINETIS_MUX('E',4,5) /* PTE4 */
#define FXIO_D6_PTE4 KINETIS_MUX('E',4,6) /* PTE4 */
#define EWM_OUT_b_PTE4 KINETIS_MUX('E',4,7) /* PTE4 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE5 */
#define TCLK2_PTE5 KINETIS_MUX('E',5,2) /* PTE5 */
#define FTM2_QD_PHA_PTE5 KINETIS_MUX('E',5,3) /* PTE5 */
#define FTM2_CH3_PTE5 KINETIS_MUX('E',5,4) /* PTE5 */
#define CAN0_TX_PTE5 KINETIS_MUX('E',5,5) /* PTE5 */
#define FXIO_D7_PTE5 KINETIS_MUX('E',5,6) /* PTE5 */
#define EWM_IN_PTE5 KINETIS_MUX('E',5,7) /* PTE5 */
#define ADC1_SE11_PTE6 KINETIS_MUX('E',6,0) /* PTE6 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE6 */
#define LPSPI0_PCS2_PTE6 KINETIS_MUX('E',6,2) /* PTE6 */
#define FTM7_FLT1_PTE6 KINETIS_MUX('E',6,3) /* PTE6 */
#define FTM3_CH7_PTE6 KINETIS_MUX('E',6,4) /* PTE6 */
#define LPUART1_RTS_PTE6 KINETIS_MUX('E',6,6) /* PTE6 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE7 */
#define FTM0_CH7_PTE7 KINETIS_MUX('E',7,2) /* PTE7 */
#define FTM3_FLT0_PTE7 KINETIS_MUX('E',7,3) /* PTE7 */
#define CMP0_IN3_PTE8 KINETIS_MUX('E',8,0) /* PTE8 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE8 */
#define FTM0_CH6_PTE8 KINETIS_MUX('E',8,2) /* PTE8 */
#define MII_RMII_MDC_PTE8 KINETIS_MUX('E',8,5) /* PTE8 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE9 */
#define FTM0_CH7_PTE9 KINETIS_MUX('E',9,2) /* PTE9 */
#define LPUART2_CTS_PTE9 KINETIS_MUX('E',9,3) /* PTE9 */
#define ENET_TMR3_PTE9 KINETIS_MUX('E',9,5) /* PTE9 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE10 */
#define CLKOUT_PTE10 KINETIS_MUX('E',10,2) /* PTE10 */
#define LPSPI2_PCS1_PTE10 KINETIS_MUX('E',10,3) /* PTE10 */
#define FTM2_CH4_PTE10 KINETIS_MUX('E',10,4) /* PTE10 */
#define FXIO_D4_PTE10 KINETIS_MUX('E',10,6) /* PTE10 */
#define TRGMUX_OUT4_PTE10 KINETIS_MUX('E',10,7) /* PTE10 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE11 */
#define LPSPI2_PCS0_PTE11 KINETIS_MUX('E',11,2) /* PTE11 */
#define LPTMR0_ALT1_PTE11 KINETIS_MUX('E',11,3) /* PTE11 */
#define FTM2_CH5_PTE11 KINETIS_MUX('E',11,4) /* PTE11 */
#define FXIO_D5_PTE11 KINETIS_MUX('E',11,6) /* PTE11 */
#define TRGMUX_OUT5_PTE11 KINETIS_MUX('E',11,7) /* PTE11 */
#define PTE12 KINETIS_MUX('E',12,1) /* PTE12 */
#define FTM0_FLT3_PTE12 KINETIS_MUX('E',12,2) /* PTE12 */
#define LPUART2_TX_PTE12 KINETIS_MUX('E',12,3) /* PTE12 */
#define FTM5_FLT0_PTE12 KINETIS_MUX('E',12,4) /* PTE12 */
#define PTE13 KINETIS_MUX('E',13,1) /* PTE13 */
#define FTM4_CH5_PTE13 KINETIS_MUX('E',13,2) /* PTE13 */
#define LPSPI2_PCS2_PTE13 KINETIS_MUX('E',13,3) /* PTE13 */
#define FTM2_FLT0_PTE13 KINETIS_MUX('E',13,4) /* PTE13 */
#define PTE14 KINETIS_MUX('E',14,1) /* PTE14 */
#define FTM0_FLT1_PTE14 KINETIS_MUX('E',14,2) /* PTE14 */
#define FTM2_FLT1_PTE14 KINETIS_MUX('E',14,4) /* PTE14 */
#define PTE15 KINETIS_MUX('E',15,1) /* PTE15 */
#define LPUART1_CTS_PTE15 KINETIS_MUX('E',15,2) /* PTE15 */
#define LPSPI2_SCK_PTE15 KINETIS_MUX('E',15,3) /* PTE15 */
#define FTM2_CH6_PTE15 KINETIS_MUX('E',15,4) /* PTE15 */
#define FTM4_FLT1_PTE15 KINETIS_MUX('E',15,5) /* PTE15 */
#define FXIO_D2_PTE15 KINETIS_MUX('E',15,6) /* PTE15 */
#define TRGMUX_OUT6_PTE15 KINETIS_MUX('E',15,7) /* PTE15 */
#define PTE16 KINETIS_MUX('E',16,1) /* PTE16 */
#define LPUART1_RTS_PTE16 KINETIS_MUX('E',16,2) /* PTE16 */
#define LPSPI2_SIN_PTE16 KINETIS_MUX('E',16,3) /* PTE16 */
#define FTM2_CH7_PTE16 KINETIS_MUX('E',16,4) /* PTE16 */
#define FTM4_FLT0_PTE16 KINETIS_MUX('E',16,5) /* PTE16 */
#define FXIO_D3_PTE16 KINETIS_MUX('E',16,6) /* PTE16 */
#define TRGMUX_OUT7_PTE16 KINETIS_MUX('E',16,7) /* PTE16 */
#define PTE17 KINETIS_MUX('E',17,1) /* PTE17 */
#define FTM7_CH5_PTE17 KINETIS_MUX('E',17,2) /* PTE17 */
#define FXIO_D5_PTE17 KINETIS_MUX('E',17,3) /* PTE17 */
#define PTE18 KINETIS_MUX('E',18,1) /* PTE18 */
#define FTM7_CH6_PTE18 KINETIS_MUX('E',18,2) /* PTE18 */
#define FXIO_D4_PTE18 KINETIS_MUX('E',18,3) /* PTE18 */
#define ADC1_SE25_PTE19 KINETIS_MUX('E',19,0) /* PTE19 */
#define PTE19 KINETIS_MUX('E',19,1) /* PTE19 */
#define FTM7_CH7_PTE19 KINETIS_MUX('E',19,2) /* PTE19 */
#define ADC1_SE26_PTE20 KINETIS_MUX('E',20,0) /* PTE20 */
#define PTE20 KINETIS_MUX('E',20,1) /* PTE20 */
#define FTM4_CH0_PTE20 KINETIS_MUX('E',20,2) /* PTE20 */
#define ADC1_SE27_PTE21 KINETIS_MUX('E',21,0) /* PTE21 */
#define PTE21 KINETIS_MUX('E',21,1) /* PTE21 */
#define FTM4_CH1_PTE21 KINETIS_MUX('E',21,2) /* PTE21 */
#define ADC1_SE28_PTE22 KINETIS_MUX('E',22,0) /* PTE22 */
#define PTE22 KINETIS_MUX('E',22,1) /* PTE22 */
#define FTM4_CH2_PTE22 KINETIS_MUX('E',22,2) /* PTE22 */
#define ADC1_SE29_PTE23 KINETIS_MUX('E',23,0) /* PTE23 */
#define PTE23 KINETIS_MUX('E',23,1) /* PTE23 */
#define FTM4_CH3_PTE23 KINETIS_MUX('E',23,2) /* PTE23 */
#define ADC1_SE30_PTE24 KINETIS_MUX('E',24,0) /* PTE24 */
#define PTE24 KINETIS_MUX('E',24,1) /* PTE24 */
#define FTM4_CH4_PTE24 KINETIS_MUX('E',24,2) /* PTE24 */
#define CAN2_TX_PTE24 KINETIS_MUX('E',24,3) /* PTE24 */
#define ADC1_SE31_PTE25 KINETIS_MUX('E',25,0) /* PTE25 */
#define PTE25 KINETIS_MUX('E',25,1) /* PTE25 */
#define FTM4_CH5_PTE25 KINETIS_MUX('E',25,2) /* PTE25 */
#define CAN2_RX_PTE25 KINETIS_MUX('E',25,3) /* PTE25 */
#define PTE26 KINETIS_MUX('E',26,1) /* PTE26 */
#define FTM4_CH6_PTE26 KINETIS_MUX('E',26,2) /* PTE26 */
#define PTE27 KINETIS_MUX('E',27,1) /* PTE27 */
#define FTM4_CH7_PTE27 KINETIS_MUX('E',27,2) /* PTE27 */
#endif
